## vsclib013.lib
## gscl45nm

# read design
read -sv dotproduct.v
hierarchy -top dotproduct

# the high-level stuff
proc; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to mycells.lib
dfflibmap -liberty gscl45nm.lib

# mapping logic to mycells.lib
abc -liberty gscl45nm.lib

# save result
tee -o pir.stat stat -liberty gscl45nm.lib

# cleanup
clean
