## vsclib013.lib
## gscl45nm

# read design
read_verilog -sv ../../PIRDSP_verilogs/DSP.v
read_verilog -sv ../../PIRDSP_verilogs/Dual_A_Register_block.v
read_verilog -sv ../../PIRDSP_verilogs/Dual_B_Register_block.v
read_verilog -sv ../../PIRDSP_verilogs/C_Register_block.v
read_verilog -sv ../../PIRDSP_verilogs/D_Register_block.v
read_verilog -sv ../../PIRDSP_verilogs/XYZW_manager.v
read_verilog -sv ../../PIRDSP_verilogs/carry_in_manager.v
read_verilog -sv ../../PIRDSP_verilogs/operation_manager.v
read_verilog -sv ../../PIRDSP_verilogs/inmode_manager.v
read_verilog -sv ../../PIRDSP_verilogs/Multiplier_xilinx.v
read_verilog -sv ../../PIRDSP_verilogs/multiplier_output_manager.v
read_verilog -sv ../../PIRDSP_verilogs/ALU.v
read_verilog -sv ../../PIRDSP_verilogs/pattern_detection.v
read_verilog -sv ../../PIRDSP_verilogs/wide_xor_block.v
read_verilog -sv ../../PIRDSP_verilogs/output_manager.v

hierarchy -top DSP

# the high-level stuff
proc; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to mycells.lib
dfflibmap -liberty gscl45nm.lib

# mapping logic to mycells.lib
abc -liberty gscl45nm.lib

# save result
tee -o pir.stat stat -liberty gscl45nm.lib



# cleanup
clean
